links.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>links</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="http://dirtysalt.info/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">links</h1>
<hr  />
<p>
Home:
</p>
<ul class="org-ul">
<li>Leslie Lamport. <a href="http://research.microsoft.com/en-us/um/people/lamport/pubs/pubs.html">http://research.microsoft.com/en-us/um/people/lamport/pubs/pubs.html</a></li>
<li>James Hamilton. <a href="http://mvdirona.com/jrh/work/">http://mvdirona.com/jrh/work/</a></li>
<li>Jeff Dean. <a href="http://research.google.com/people/jeff/">http://research.google.com/people/jeff/</a></li>
<li>Rob Pike. <a href="http://www.herpolhode.com/rob/">http://www.herpolhode.com/rob/</a></li>
<li>Russ Cox. <a href="https://swtch.com/~rsc/">https://swtch.com/~rsc/</a></li>
<li>Eric S. Raymond. <a href="http://www.catb.org/esr/">http://www.catb.org/esr/</a></li>
<li>Matt Welsh. <a href="http://www.mdw.la/">http://www.mdw.la/</a></li>
<li>Joe Armstrong. <a href="http://joearms.github.io/">http://joearms.github.io/</a></li>
<li>Don Knuth. <a href="http://www-cs-faculty.stanford.edu/~uno/">http://www-cs-faculty.stanford.edu/~uno/</a></li>
<li>Robert Morris. <a href="http://pdos.csail.mit.edu/~rtm/">http://pdos.csail.mit.edu/~rtm/</a></li>
<li>Matei Zaharia. <a href="http://people.csail.mit.edu/matei/">http://people.csail.mit.edu/matei/</a> <a href="http://www.cs.berkeley.edu/~matei/">#</a> Spark</li>
<li>R. Kent Dybvig. <a href="http://www.cs.indiana.edu/~dyb/">http://www.cs.indiana.edu/~dyb/</a> # Scheme</li>
<li>陈寅恪 <a href="http://en.wikipedia.org/wiki/Chen_Yinke">http://en.wikipedia.org/wiki/Chen_Yinke</a>
<ul class="org-ul">
<li><a href="./reply-to-science-institution.html">对科学院的答复</a></li>
<li><a href="http://www.tudou.com/listplay/y14UtaOL_To/fqsa-SxCecE.html">http://www.tudou.com/listplay/y14UtaOL_To/fqsa-SxCecE.html</a></li>
<li><a href="http://www.tudou.com/listplay/y14UtaOL_To/fqSv4ytJFsA.html">http://www.tudou.com/listplay/y14UtaOL_To/fqSv4ytJFsA.html</a></li>
</ul></li>
<li>蔡元培 <a href="http://en.wikipedia.org/wiki/Cai_Yuanpei">http://en.wikipedia.org/wiki/Cai_Yuanpei</a>
<ul class="org-ul">
<li><a href="http://www.tudou.com/listplay/y14UtaOL_To/Q1xkcXDXaAo.html">http://www.tudou.com/listplay/y14UtaOL_To/Q1xkcXDXaAo.html</a></li>
<li><a href="http://www.tudou.com/listplay/y14UtaOL_To/--wU0Hiroig.html">http://www.tudou.com/listplay/y14UtaOL_To/--wU0Hiroig.html</a></li>
</ul></li>
</ul>

<hr  />
<p>
Blog:
</p>
<ul class="org-ul">
<li><a href="blog.html">My blog</a> - <a href="about-me.html">About me</a></li>
<li>jwz. <a href="http://www.jwz.org/blog/">blog</a> <a href="http://www.jwz.org/doc/">doc</a></li>
</ul>
<blockquote>
<p>
"you can divide our industry into two kinds of people: those who want to go work for a company to make it successful, and those who want to go work for a successful company. " - <a href="http://www.jwz.org/gruntle/nomo.html">jwz</a>)
</p>
</blockquote>

<ul class="org-ul">
<li>Werner Vogels. <a href="http://www.allthingsdistributed.com/">http://www.allthingsdistributed.com/</a></li>
<li>Nathan Marz. <a href="http://nathanmarz.com/">http://nathanmarz.com/</a> # Storm</li>
<li>Matt Might. <a href="http://matt.might.net/">http://matt.might.net/</a> # Compiler, FP</li>
<li>Jeff Preshing. <a href="http://www.preshing.com/">http://www.preshing.com/</a> # C++</li>
<li>Andrej Karpathy. <a href="http://karpathy.github.io/">http://karpathy.github.io/</a> # Neural Network.</li>
<li>Herb Sutter. <a href="http://www.gotw.ca/">http://www.gotw.ca/</a> # C++</li>
<li>陈皓 <a href="http://coolshell.cn/">http://coolshell.cn/</a></li>
<li>Peter Hintjens. <a href="http://hintjens.com/">http://hintjens.com/</a></li>
<li>IT Hare on Soft.ware : <a href="http://ithare.com/">http://ithare.com/</a> # C++, High Performance</li>
<li>王垠 <a href="http://www.yinwang.org/">http://www.yinwang.org/</a></li>
<li>Colah's blog : <a href="http://colah.github.io/archive.html">http://colah.github.io/archive.html</a> # neural nets</li>
<li>Bret Victor : <a href="http://worrydream.com/#!/TheFutureOfProgramming">http://worrydream.com/#!/TheFutureOfProgramming</a> # Programming, Designer.</li>
</ul>

<hr  />
<p>
Site:
</p>
<ul class="org-ul">
<li>Mechanical Sympathy : <a href="http://mechanical-sympathy.blogspot.co.at/">http://mechanical-sympathy.blogspot.co.at/</a> # Concurrency, JVM, CPU, Memory</li>
<li>Paper Trail : <a href="http://the-paper-trail.org/blog/">http://the-paper-trail.org/blog/</a></li>
<li>Building Scalable Systems : <a href="http://scalingsystems.com/">http://scalingsystems.com/</a></li>
<li>Systems We Make : <a href="http://www.systemswemake.com/">http://www.systemswemake.com/</a></li>
<li>37Signals : <a href="http://signalvnoise.com/">http://signalvnoise.com/</a></li>
<li>Percona : <a href="http://www.mysqlperformanceblog.com/">http://www.mysqlperformanceblog.com/</a> # MySQL</li>
<li>DBMS 2 : : <a href="http://www.dbms2.com/">http://www.dbms2.com/</a> # Database</li>
<li>Small Datum : <a href="http://smalldatum.blogspot.com/">http://smalldatum.blogspot.com/</a></li>
</ul>

<hr  />
<p>
Conf:
</p>
<ul class="org-ul">
<li>stangeloop <a href="http://www.thestrangeloop.com/about.html">http://www.thestrangeloop.com/about.html</a></li>
<li>ICFP International Conference on Functional Programming</li>
<li>ICML International Conference on Machine Learning</li>
<li>IJCAI International Joint Conference on Artificial Intelligence</li>
<li>PLDI ACM-SIGPLAN Conference on Programming Language Design &amp; Implementation</li>
<li>SOSP ACM SIGOPS Symposium on Operating Systems Principles <a href="http://sigops.org/sosp/">http://sigops.org/sosp/</a></li>
<li>SOSP History Day <a href="http://sigops.org/sosp/sosp15/history/index.html">http://sigops.org/sosp/sosp15/history/index.html</a></li>
<li>SIGKDD ACM International Conference on Knowledge Discovery and Data Mining</li>
<li>VLDB International Conference on Very Large Databases</li>
</ul>

<hr  />
<p>
Archive:
</p>
<ul class="org-ul">
<li>The Best of 2012 | Dr Dobb's : <a href="http://www.drdobbs.com/architecture-and-design/the-best-of-2012/240145121">http://www.drdobbs.com/architecture-and-design/the-best-of-2012/240145121</a></li>
<li>The Best of 2013 | Dr Dobb's : <a href="http://www.drdobbs.com/architecture-and-design/the-best-of-2013/240164956">http://www.drdobbs.com/architecture-and-design/the-best-of-2013/240164956</a></li>
<li>High Scalability - All Time Favorites : <a href="http://highscalability.com/all-time-favorites/">http://highscalability.com/all-time-favorites/</a></li>
</ul>
</div>
<!-- DISQUS BEGIN --><div id="disqus_thread"></div><script type="text/javascript">/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * *//* required: replace example with your forum shortname  */var disqus_shortname = 'dirlt';var disqus_identifier = 'links.html';var disqus_title = 'links.html';var disqus_url = 'http://dirtysalt.info/links.html';/* * * DON'T EDIT BELOW THIS LINE * * */(function() {var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);})();</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a><!-- DISQUS END --></body>
</html>
